{"timestamp": "2025-08-12T13:22:02.158419", "user": "hi", "bot": " Bonjour ! Comment puis-je vous aider aujourd'hui ? ", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-12T13:23:04.824697", "user": "umi", "bot": " L'UMI (Université Marocaine des Sciences Sociales) est une université marocaine qui propose un enseignement supérieur dans plusieurs domaines, notamment les sciences sociales. Les étudiants ont la possibilité de réinscrire à un module non validé une fois. Cela peut se faire après avoir obtenu l'autorisation du Coordinateur de la formation. Le seuil de validation d'année est égal au seuil de validation de module, c'est-à-dire qu'une année doit être validée pour que chaque module soit également validé. L'UMI a un site web et une adresse e-mail qui sont fournies pour la communication et le renseignement sur les programmes universitaires et d'autres informations utiles. ", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-12T13:25:10.055377", "user": "dut", "bot": " Le diplôme de la Licence en Sciences et Techniques est délivré à l'issue d'un module validé ou de la compensation selon les conditions spécifiées dans le contexte fourni. La validation du module peut se faire soit par une note supérieure ou égale à 10 sur 20, soit par compensation si le semestre dont fait partie ce module est validé. Le contrôle de rattrapage est également mentionné, mais les modalités spécifiques de cette contrôle ne sont pas détaillées dans le contexte fourni. Le diplôme est délivré lorsque toutes les filières sont validées. ", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-12T13:26:34.893943", "user": "encg", "bot": " En tant qu'étudiant en Nationales de Commerce et de Gestion durant 10 semestres pratiques, il y a deux passerelles pour accéder aux ENCG : les quatre premiers semestres correspondant à une préparation aux études de gestion et de commerce axées inférieure à 5/20 et le 5ème semestre. Les différents éléments d'un établissement sont organisés en modules constituant une unité cohérente. L'étudiant peut se réinscrire une fois à un module non validé, il peut bénéficier d'une dérogation octroyée par le Coordonnateur de la formation. ", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-12T13:28:10.075004", "user": "a base de quoi ces donner", "bot": " Les données fournies semblent décritre un module d'une année préparatoire qui peut être réinscrit une fois par étudiant. Le Coordonnateur de la formation est chargé d'octroyer une dérogation pour l'étudiant souhaitant réinscrire à un module non validé. L'année de validation d'un module est égale à celle de validation de l'année préparatoire et elle peut être validée par le Coordonnateur de la formation. Il existe également un fax et un e-mail pour contacter la présidence de l'institution. Le reste des informations fournies est peu clair et ne permet pas de comprendre les détails spécifiques du module ou de l'année préparatoire en question. ", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
