{"timestamp": "2025-08-12T13:22:02.158419", "user": "hi", "bot": " Bonjour ! Comment puis-je vous aider aujourd'hui ? ", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-12T13:23:04.824697", "user": "umi", "bot": " L'UMI (Université Marocaine des Sciences Sociales) est une université marocaine qui propose un enseignement supérieur dans plusieurs domaines, notamment les sciences sociales. Les étudiants ont la possibilité de réinscrire à un module non validé une fois. Cela peut se faire après avoir obtenu l'autorisation du Coordinateur de la formation. Le seuil de validation d'année est égal au seuil de validation de module, c'est-à-dire qu'une année doit être validée pour que chaque module soit également validé. L'UMI a un site web et une adresse e-mail qui sont fournies pour la communication et le renseignement sur les programmes universitaires et d'autres informations utiles. ", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-12T13:25:10.055377", "user": "dut", "bot": " Le diplôme de la Licence en Sciences et Techniques est délivré à l'issue d'un module validé ou de la compensation selon les conditions spécifiées dans le contexte fourni. La validation du module peut se faire soit par une note supérieure ou égale à 10 sur 20, soit par compensation si le semestre dont fait partie ce module est validé. Le contrôle de rattrapage est également mentionné, mais les modalités spécifiques de cette contrôle ne sont pas détaillées dans le contexte fourni. Le diplôme est délivré lorsque toutes les filières sont validées. ", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-12T13:26:34.893943", "user": "encg", "bot": " En tant qu'étudiant en Nationales de Commerce et de Gestion durant 10 semestres pratiques, il y a deux passerelles pour accéder aux ENCG : les quatre premiers semestres correspondant à une préparation aux études de gestion et de commerce axées inférieure à 5/20 et le 5ème semestre. Les différents éléments d'un établissement sont organisés en modules constituant une unité cohérente. L'étudiant peut se réinscrire une fois à un module non validé, il peut bénéficier d'une dérogation octroyée par le Coordonnateur de la formation. ", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-12T13:28:10.075004", "user": "a base de quoi ces donner", "bot": " Les données fournies semblent décritre un module d'une année préparatoire qui peut être réinscrit une fois par étudiant. Le Coordonnateur de la formation est chargé d'octroyer une dérogation pour l'étudiant souhaitant réinscrire à un module non validé. L'année de validation d'un module est égale à celle de validation de l'année préparatoire et elle peut être validée par le Coordonnateur de la formation. Il existe également un fax et un e-mail pour contacter la présidence de l'institution. Le reste des informations fournies est peu clair et ne permet pas de comprendre les détails spécifiques du module ou de l'année préparatoire en question. ", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-14T10:23:41.999296", "user": "hi", "bot": "Bonjour ! Comment puis-je vous aider aujourd'hui ?", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-14T10:24:46.728723", "user": "ms", "bot": "Je suis désolé, mais je n'ai pas reçu de question de l'utilisateur pour vous aider à répondre. Si vous avez une question sur le sujet de la formation continue qualifiante, veuillez me la poser afin que je puisse vous fournir une réponse précise et utile.", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-14T10:26:15.239252", "user": "oui formation continue", "bot": "L'UMI, établissement à accès régulé au Maroc, est un centre de formation initiale et continue, y compris la préparation des jeunes à l'insertion dans la vie active par le développement des savoir-faire. En tant qu'établissement d'enseignement supérieur public, l'UMI dispose également de vocations normales pour délivrer des diplômes y afférents. L'UMI organise des formations continues pour répondre aux besoins individuels ou collectifs et contribue au développement global du pays en mettant l'accent sur la contribution à la promotion des valeurs universelles.", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-14T10:55:33.345639", "user": "hi", "bot": "Bonjour! Comment puis-je vous aider aujourd'hui?", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-14T11:28:18.144042", "user": "hi", "bot": "Bonjour ! Comment puis-je vous aider aujourd'hui ?", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-14T13:24:28.399679", "user": "hi", "bot": "Salut ! Comment puis-je vous aider aujourd'hui ?", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-14T13:26:37.742407", "user": "hi", "bot": "Bonjour ! Comment puis-je vous aider aujourd'hui ?", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-14T13:27:56.098055", "user": "my name hafsa", "bot": "Bonjour Hafsa, comment puis-je vous aider aujourd’hui ? Nous sommes tous prêts à répondre à vos questions sur l’UMI et ses missions principales dans le renforcement de l’identité islamique et nationale, la formation initiale et continue, le développement et la diffusion du savoir, la préparation des jeunes à l’insertion dans la vie active, la recherche scientifique et technologique, la réalisation d’expertises, la contribution au développement global du pays et à la promotion des valeurs universelles. Nous sommes également disposés à vous aider sur les enseignements et formations initiales y afférents ainsi que sur les formations continues organisées par l’UMI pour répondre aux besoins individuels ou collectifs. De quoi avez-vous besoin aujourd'hui ?", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-14T13:28:59.124778", "user": "what is my name", "bot": "Marjane", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-15T09:49:30.260901", "user": "hi", "bot": "Bonjour, comment puis-je vous aider aujourd'hui ?", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-15T09:52:32.987977", "user": "parler en arab", "bot": "اللغة باللغات العربية والفرنسية، والمهادات الطبية والصحية، والقانون والشروط، والخطط والأساليب، والقوانين والشروط.", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-15T10:06:58.356683", "user": "qu'est ce que vou voyer", "bot": "A imagem mostra um lute em frente a uma porta. O lute parece ser de madeira e possui um desenho de rostos na parte superior, mas o resto do instrumento não está visível na imagem. A luta está proporcionalmente pequena para a porta, que apresenta uma varanda sobre a qual há uma grade. O fundo da imagem mostra uma parede de alvenaria e um telhado de telhas que reforça a estrutura das grades da varanda. A fotografia foi tirada em dia clara, o que permite observar detalhes do lute e do ambiente ao redor.", "metadata": {"rag_used": false, "has_image": true, "model": "llava:latest"}}
{"timestamp": "2025-08-15T10:08:22.751956", "user": "en francais", "bot": "Je suis désolé, mais je ne peux pas vous aider à résoudre cette question car elle n'a pas été posée dans le contexte d'utilisation précédent et il n'y a pas de contexte fourni pour vous aider. Si vous pouvez me fournir un peu plus de détails, je serais ravi de vous aider à répondre à votre question.", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-15T10:35:48.983124", "user": "hi", "bot": "Salut ! Comment puis-je vous aider aujourd'hui ?", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-15T10:59:12.296747", "user": "hi", "bot": "Bonjour ! Comment puis-je vous aider aujourd'hui ?", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-15T11:00:07.746886", "user": "c'est quoi umi", "bot": "UMI est un acronyme qui signifie Université Moulay Ismaïl, une université marocaine.", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-15T11:02:06.140509", "user": "c'est quoi dans cette image", "bot": "Dans l'image, il y a une liste de diplômes qui peuvent être délivrés à des formations continues pour des diplômantes d'université. Les deux diplômes mentionnés sont la Licence Professionnelle d'Université (LPU) et la Licence en Sciences et Techniques d'Université (LSTU).", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-15T11:15:10.745759", "user": "c'es quoi ca", "bot": "Ca est une année non validée pour l’étudiant qui doit suivre obligatoirement et prioritairement les modules non validés à l’université Moulay Ismaïl. La validation d’année peut être obtenue en répondant aux conditions de validation, y compris la moyenne générale de Tél de 05.35.46.73.06 ou 05.35.46.73.07 et fournissant un fax à 05.35.46.73.05 et une adresse e-mail à presidence@umi.ac.ma. En cas d’année non validée, l’étudiant peut s’inscrire à tout ou partie des modules non validés.", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
{"timestamp": "2025-08-15T11:39:09.820464", "user": "what you see inthe image", "bot": "Je ne peux pas voir d'image. Si vous pouvez me donner plus de détails ou si vous avez une question spécifique, je serais ravi de vous aider à répondre.", "metadata": {"rag_used": true, "has_image": false, "model": "llava:latest"}}
